[
    "How do I register an account?",
    "What payment methods are supported?",
    "Is there a return policy?",
    "How can I track my order?",
    "Are there discounts for bulk orders?",
    "Can I customize my shirt?",
    "How long does shipping take?",
    "What are the available sizes?",
    "Is there a loyalty program?",
    "How do I contact customer support?",
    "Are the shirts machine washable?",
    "What is the material used for the shirts?",
    "Are international deliveries available?",
    "How secure is the payment process?",
    "What happens if my shirt doesn\"t fit?",
    "Are there limited edition shirts?",
    "Can I cancel or modify my order?",
    "Are there different collar types available?",
    "Do you offer gift wrapping?",
    "What is the process for returns and exchanges?",
    "Can I use multiple payment methods?",
    "Are there any membership benefits?",
    "Do you offer express shipping options?",
    "Are there eco-friendly options available?",
    "How do I apply a discount code?",
    "Are there size charts available?",
    "What is the process for shirt customization?",
    "Do you offer gift cards?",
    "What is the estimated delivery time?",
    "Are there any seasonal promotions?",
    "Can I change the shipping address after placing the order?",
    "What is your policy on damaged items?",
    "Are there options for sleeve lengths?",
    "How do I check the order status?",
    "Do you offer a referral program?",
    "What is the procedure for bulk orders?",
    "Are there any color variations available?",
    "Can I modify the shirt design after ordering?",
    "What is the procedure for shirt care?",
    "Do you offer student discounts?",
    "Are there any restrictions on international orders?",
    "Can I request a specific shirt design?",
    "How do I subscribe to newsletters for updates?",
    "Are there any age restrictions for ordering?",
    "What is your privacy policy for customer data?",
    "Do you offer a try-before-buying service?",
    "Can I purchase a gift for someone?",
    "Are there any limited-time offers?",
    "How do I unsubscribe from promotional emails?",
    "Are there any mobile app-exclusive offers?",
    "Can I return a customized shirt?",
    "Do you have physical stores for trying out shirts?",
    "What is the process for shirt alterations?",
    "Are there any restrictions on using discount codes?",
    "Do you offer assistance for size selection?",
    "Are there any special promotions for holidays?",
    "How do I leave feedback or reviews?",
    "Do you offer payment installment plans?",
    "Can I view the shirt in different colors online?",
    "What happens if the shirt I want is out of stock?",
    "Are there any rewards for frequent shoppers?",
    "How do I request a refund?",
    "What is the process for shirt measurements?",
    "Do you offer packaging for gifting?",
    "Are there any limitations on the number of shirts per order?",
    "Can I receive notifications for restocked items?",
    "Do you have an affiliate program?",
    "How do I know if a shirt is authentic?",
    "Are there any benefits for newsletter subscribers?",
    "Can I change the delivery date after placing an order?",
    "Do you offer free shipping for certain orders?",
    "What is the process for shirt embroidery?",
    "Are there any restrictions on order quantity for discounts?",
    "Can I request a shirt design not listed on the site?",
    "How do I find washing instructions for the shirt?",
    "Are there any exclusive offers for social media followers?",
    "Do you have a satisfaction guarantee policy?",
    "Can I return a shirt purchased during a sale?",
    "How do I add or remove items from my cart?",
    "Are there any virtual try-on features available?",
    "What is the process for shirt repairs?",
    "Do you offer discounts for first-time customers?",
    "Can I request a specific shirt packaging?",
    "How do I view the order history?",
    "Are there any shipping restrictions for certain locations?",
    "Can I place an order without creating an account?",
    "What is the process for cancelling a shirt customization?",
    "Do you offer personalization services?",
    "Are there any online chat support options?",
    "How do I find the care instructions for the shirt material?",
    "Can I preorder upcoming shirt collections?",
    "What is the procedure for shirt resizing?",
    "Do you offer discounts for bulk corporate orders?",
    "Are there any flash sales or limited-time offers?",
    "Can I exchange a shirt for a different size or color?",
    "How do I access the customer loyalty program?",
    "Do you have a newsletter for trend updates?",
    "What is the process for shirt monogramming?",
    "Are there any shipping delays during peak seasons?",
    "Can I return a shirt that was a gift?",
    "How do I get notifications for new shirt arrivals?",
    "Are there any offers for subscribing to SMS alerts?",
    "Can I request a shirt with specific fabric properties?",
    "What is the process for bulk order customization?",
    "Do you offer discounts for special occasions?",
    "Are there any limitations on applying multiple discounts?",
    "Can I request a shirt with a unique pattern or print?",
    "How do I contact support for technical issues?",
    "Do you have a size recommendation feature?",
    "What is the process for canceling an order?",
    "Are there any seasonal collections or limited editions?",
    "Can I receive notifications for shirt restocks?",
    "How do I get early access to new shirt releases?",
    "Do you offer customization for shirt packaging?",
    "Are there any specific requirements for international orders?",
    "Can I return a shirt without the original packaging?",
    "How do I access exclusive offers for loyalty members?",
    "What is the process for shirt resizing alterations?",
    "Do you offer discounts for bulk charity orders?",
    "Are there any time-bound discounts for newsletter subscribers?",
    "Can I request a shirt design inspired by a specific theme?",
    "How do I contact customer service for order assistance?",
    "Do you provide suggestions for coordinating shirts with accessories?",
    "What is the procedure for shirt material care in different climates?",
    "Are there any special promotions for occasions like birthdays?",
    "Can I receive notifications for exclusive designer collections?",
    "How do I participate in promotional events or giveaways?",
    "Do you offer customization for shirt wrapping and presentation?",
    "Are there any specific restrictions for international return policies?",
    "Can I return a shirt purchased during a clearance sale?",
    "How do I get notifications for limited-edition shirt releases?",
    "Are there any limited-time offers for members of the loyalty program?",
    "Can I request a shirt with specific stitching or embroidery details?",
    "How do I contact support for inquiries regarding international orders?",
    "Do you provide guides for maintaining shirt quality over time?",
    "What is the process for shirt alterations after delivery?",
    "Are there any exclusive offers for subscribing to the mobile app?",
    "Can I avail of a discount for a previously purchased shirt with a new offer?",
    "How do I access exclusive discounts for corporate partnerships?",
    "Do you offer recommendations for shirt care based on usage frequency?",
    "What is the procedure for canceling a customized shirt order?",
    "Are there any time-sensitive discounts for social media followers?",
    "Can I request a shirt with special printing techniques or effects?",
    "How do I reach out to customer support for bulk order assistance?",
    "Do you provide information on shirt durability and long-term use?",
    "What is the process for shirt alterations for specific body measurements?",
    "Are there any special perks for members of the loyalty program during events?",
    "Can I receive notifications for surprise offers or flash sales?",
    "How do I access exclusive early access to limited-edition shirt releases?",
    "Do you offer customization options for gift messages with shirt orders?",
    "Are there any country-specific restrictions for international orders and returns?",
    "Can I return a shirt received as a gift without the original purchase details?",
    "How do I subscribe to notifications for exclusive collaborations with designers?",
    "Do you offer assistance in finding the right shirt size for different body types?",
    "What is the process for canceling a shirt customization order after payment?",
    "Are there any exclusive offers for members of the loyalty program on holidays?",
    "Can I request a shirt with specific features for adaptive or assisted dressing needs?",
    "How do I contact customer support for inquiries about shirt material sustainability?",
    "Do you provide guidelines on washing and maintaining shirts in various environmental conditions?"
]